#############################################################
# ~/.Brewfile - Software Installs for MacOS                 #
#                                                           #
# List of packages to be installed / updated via Homebrew   #
# Apps are sorted by category, and arranged alphabetically  #
# Be sure to delete / comment out anything you do not need  #
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile #
# Source GH repository: https://github.com/JunjieG/Brewfile #
# See brew docs for more info: https://docs.brew.sh/Manpage #
#                                                           #
# License: MIT © Alicia Sykes 2022 <https://aliciasykes.com>#
#############################################################

# Options
cask_args appdir: '~/Applications', require_sha: true

# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/services'
tap 'blacktop/tap'
tap 'browsh-org/homebrew-browsh'
tap 'espanso/espanso'
tap 'jesseduffield/lazygit'
tap 'koekeishiya/formulae'
tap 'kdash-rs/kdash'

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew 'git'          # Version controll
brew 'neovim'       # Text editor
brew 'zellij'       # Better tmux (arguably)

# CLI Basics
brew 'bat'          # Output highlighting (better cat)
brew 'ctags'        # Indexing of file info + headers
brew 'diff-so-fancy' # Readable file compares (better diff)
brew 'eza'          # Listing files with info (better ls)
brew 'fzf'          # Fuzzy file finder and filtering
brew 'hyperfine'    # Benchmarking for arbitrary commands
brew 'jq'           # JSON parser, output and query files
brew 'procs'        # Advanced process viewer (better ps)
brew 'ripgrep'      # Searching within files (better grep)
brew 'sd'           # RegEx find and replace (better sed)
brew 'tealdeer'     # tldr but faster
brew 'tree'         # Directory listings as tree structure
brew 'zoxide'       # Auto-learning navigation (better cd)

# CLI Monitoring and Performance Apps
brew 'btop'       # Resource monitoring (like htop)

# CLI Productivity Apps
brew 'newsboat'     # RSS / ATOM reader
brew 'task'         # Todo + task management

# CLI Development Suits
brew 'httpie'       # HTTP / API testing testing client
brew 'lazygit'      # Full Git management app

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
cask 'boop'           # Text transformation tool
cask 'warp'          # Better terminal emulator
cask 'postman'        # HTTP API testing app

# Development Langs, Compilers, Package Managers and SDKs
brew 'openjdk'        # Java development kit
brew 'python'         # Python interpreter

# Development Utils
brew 'terminal-notifier' # Trigger Mac notifications from terminal

#############################################################
# Desktop Applications                                      #
#############################################################

# Media
brew 'pandoc'       # Universal file converter
brew 'anhoder/go-musicfox/go-musicfox' # CLI网易云

# Personal Applications
cask 'obsidian'       # Knowledge base that works on top of a local folder of plain text Markdown files

# Browsers
cask 'arc'

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

# Fonts
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-meslo-lg-nerd-font'

# Mac OS Mods and Imrovments
cask 'alt-tab'        # Much better alt-tab window switcher

# Mac OS Utility Apps
cask 'keka'           # File archiver and extractor

# EOF
